---
kind: type
id: T:Autodesk.Revit.DB.InSessionPrintSetting
source: html/4d7b791c-4d3e-d9ac-de82-fcf602173edd.htm
---
# Autodesk.Revit.DB.InSessionPrintSetting

Represents the in-session Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.

## Syntax (C#)
```csharp
public class InSessionPrintSetting : IPrintSetting,
	IDisposable
```

## Remarks
The in-session PrintSetting can't be stored in document.